create_clock -period 20.000 -name system_clock -waveform {0.000 10.000} -add [get_ports system_clock]
create_clock -period 100.000 -name serial_clock -waveform {0.000 50.000} -add [get_ports SCLK]
set_input_delay -clock [get_clocks system_clock] -add_delay 2.000 [get_ports input_ready]
set_input_delay -clock [get_clocks serial_clock] -add_delay 2.000 [get_ports {MOSI SS}]
set_output_delay -clock [get_clocks system_clock] -add_delay 2.000 [get_ports {{debug_output[0]} {debug_output[1]} {debug_output[2]} {debug_output[3]} {debug_output[4]} {debug_output[5]} {debug_output[6]} {debug_output[7]} {output_spikes[0]} {output_spikes[1]}}]
set_output_delay -clock [get_clocks serial_clock] -add_delay 2.000 [get_ports {data_valid_out MISO spi_instruction_done}]

#create_generated_clock -name generated_clock -source [get_ports system_clock] -divide_by 512 -add -master_clock system_clock [get_pins clk_div_inst/clk_out_reg/Q]
create_generated_clock -name generated_clock -source [get_ports system_clock] -divide_by 2 -add -master_clock system_clock [get_pins clk_div_inst/clk_out_reg/Q]

set_clock_groups -asynchronous -group [get_clocks system_clock] -group [get_clocks generated_clock] -group [get_clocks serial_clock]

set_false_path -reset_path -from [get_ports rst_n]

set_property PACKAGE_PIN W15 [get_ports {debug_output[7]}]
set_property PACKAGE_PIN W13 [get_ports {debug_output[6]}]
set_property PACKAGE_PIN W14 [get_ports {debug_output[5]}]
set_property PACKAGE_PIN U15 [get_ports {debug_output[4]}]
set_property PACKAGE_PIN U16 [get_ports {debug_output[3]}]
set_property PACKAGE_PIN V13 [get_ports {debug_output[2]}]
set_property PACKAGE_PIN V14 [get_ports {debug_output[1]}]
set_property PACKAGE_PIN U14 [get_ports {debug_output[0]}]
set_property PACKAGE_PIN W17 [get_ports {output_spikes[1]}]
set_property PACKAGE_PIN V15 [get_ports {output_spikes[0]}]
set_property PACKAGE_PIN V17 [get_ports data_valid_out]
set_property PACKAGE_PIN T18 [get_ports input_ready]
set_property PACKAGE_PIN W16 [get_ports MISO]
set_property PACKAGE_PIN T17 [get_ports rst_n]
set_property PACKAGE_PIN U18 [get_ports MOSI]
set_property PACKAGE_PIN M18 [get_ports SCLK]
set_property PACKAGE_PIN V16 [get_ports spi_instruction_done]
set_property PACKAGE_PIN U17 [get_ports SS]
set_property PACKAGE_PIN P18 [get_ports system_clock]
